addons/l10n_it_stock_ddt/tests/expected_xmls/deferred_invoice.xml

<p:FatturaElettronica xmlns:p="http://ivaservizi.agenziaentrate.gov.it/docs/xsd/fatture/v1.2" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xsi:schemaLocation="http://ivaservizi.agenziaentrate.gov.it/docs/xsd/fatture/v1.2 http://www.fatturapa.gov.it/export/fatturazione/sdi/fatturapa/v1.2/Schema_del_file_xml_FatturaPA_versione_1.2.xsd" versione="FPR12">
    <FatturaElettronicaHeader>
        <DatiTrasmissione>
            <IdTrasmittente>
                <IdPaese>IT</IdPaese>
                <IdCodice>01234560157</IdCodice>
            </IdTrasmittente>
            <ProgressivoInvio>V202000001</ProgressivoInvio>
            <FormatoTrasmissione>FPR12</FormatoTrasmissione>
            <CodiceDestinatario>0000000</CodiceDestinatario>
            <ContattiTrasmittente>
                <Telefono>0266766700</Telefono>
                <Email>test@test.it</Email>
            </ContattiTrasmittente>
        </DatiTrasmissione>
        <CedentePrestatore>
            <DatiAnagrafici>
                <IdFiscaleIVA>
                    <IdPaese>IT</IdPaese>
                    <IdCodice>01234560157</IdCodice>
                </IdFiscaleIVA>
                <CodiceFiscale>01234560157</CodiceFiscale>
                <Anagrafica>
                    <Denominazione>company_2_data</Denominazione>
                </Anagrafica>
                <RegimeFiscale>RF01</RegimeFiscale>
            </DatiAnagrafici>
            <Sede>
                <Indirizzo>1234 Test Street </Indirizzo>
                <CAP>12345</CAP>
                <Comune>Prova</Comune>
                <Nazione>IT</Nazione>
            </Sede>
        </CedentePrestatore>
        <CessionarioCommittente>
            <DatiAnagrafici>
                <IdFiscaleIVA>
                    <IdPaese>IT</IdPaese>
                    <IdCodice>00465840031</IdCodice>
                </IdFiscaleIVA>
                <CodiceFiscale>93026890017</CodiceFiscale>
                <Anagrafica>
                    <Denominazione>Alessi</Denominazione>
                </Anagrafica>
            </DatiAnagrafici>
            <Sede>
                <Indirizzo>Via Privata Alessi 6 </Indirizzo>
                <CAP>28887</CAP>
                <Comune>Milan</Comune>
                <Nazione>IT</Nazione>
            </Sede>
        </CessionarioCommittente>
    </FatturaElettronicaHeader>
    <FatturaElettronicaBody>
        <DatiGenerali>
            <DatiGeneraliDocumento>
                <TipoDocumento>TD24</TipoDocumento>
                <Divisa>EUR</Divisa>
                <Data>2020-02-03</Data>
                <Numero>INV/2020/00001</Numero>
                <ImportoTotaleDocumento>2427.80</ImportoTotaleDocumento>
            </DatiGeneraliDocumento>
            <DatiOrdineAcquisto>
               <IdDocumento>SO-ITDDT0001</IdDocumento>
            </DatiOrdineAcquisto>
            <DatiDDT>
                <NumeroDDT>compa/OUT/DDT00001</NumeroDDT>
                <DataDDT>2020-02-02</DataDDT>
                <RiferimentoNumeroLinea>2</RiferimentoNumeroLinea>
                <RiferimentoNumeroLinea>3</RiferimentoNumeroLinea>
            </DatiDDT>
            <DatiDDT>
                <NumeroDDT>compa/OUT/DDT00002</NumeroDDT>
                <DataDDT>2020-02-02</DataDDT>
                <RiferimentoNumeroLinea>2</RiferimentoNumeroLinea>
                <RiferimentoNumeroLinea>3</RiferimentoNumeroLinea>
            </DatiDDT>
        </DatiGenerali>
        <DatiBeniServizi>
            <DettaglioLinee>
                <NumeroLinea>1</NumeroLinea>
                <CodiceArticolo>
                    <CodiceTipo>INTERNAL</CodiceTipo>
                    <CodiceValore>PRE-PAID</CodiceValore>
                </CodiceArticolo>
                <Descrizione>[PRE-PAID] product_service_order product_service_order</Descrizione>
                <Quantita>5.00</Quantita>
                <UnitaMisura>Hours</UnitaMisura>
                <PrezzoUnitario>90.00000000</PrezzoUnitario>
                <PrezzoTotale>450.00000000</PrezzoTotale>
                <AliquotaIVA>22.00</AliquotaIVA>
            </DettaglioLinee>
            <DettaglioLinee>
                <NumeroLinea>2</NumeroLinea>
                <CodiceArticolo>
                    <CodiceTipo>INTERNAL</CodiceTipo>
                    <CodiceValore>FURN_9999</CodiceValore>
                </CodiceArticolo>
                <Descrizione>[FURN_9999] product_order_no product_order_no</Descrizione>
                <Quantita>5.00</Quantita>
                <PrezzoUnitario>280.00000000</PrezzoUnitario>
                <PrezzoTotale>1400.00000000</PrezzoTotale>
                <AliquotaIVA>22.00</AliquotaIVA>
            </DettaglioLinee>
            <DettaglioLinee>
                <NumeroLinea>3</NumeroLinea>
                <CodiceArticolo>
                    <CodiceTipo>INTERNAL</CodiceTipo>
                    <CodiceValore>FURN_7777</CodiceValore>
                </CodiceArticolo>
                <Descrizione>[FURN_7777] product_delivery_no product_delivery_no</Descrizione>
                <Quantita>2.00</Quantita>
                <PrezzoUnitario>70.00000000</PrezzoUnitario>
                <PrezzoTotale>140.00000000</PrezzoTotale>
                <AliquotaIVA>22.00</AliquotaIVA>
            </DettaglioLinee>
            <DatiRiepilogo>
                <AliquotaIVA>22.00</AliquotaIVA>
                    <ImponibileImporto>1990.00</ImponibileImporto>
                    <Imposta>437.80</Imposta>
                <EsigibilitaIVA>I</EsigibilitaIVA>
            </DatiRiepilogo>
        </DatiBeniServizi>
        <DatiPagamento>
            <CondizioniPagamento>TP02</CondizioniPagamento>
                <DettaglioPagamento>
                    <ModalitaPagamento>MP05</ModalitaPagamento>
                    <DataScadenzaPagamento>2020-02-03</DataScadenzaPagamento>
                    <ImportoPagamento>2427.80</ImportoPagamento>
                    <CodicePagamento>INV/2020/00001</CodicePagamento>
                </DettaglioPagamento>
        </DatiPagamento>
    </FatturaElettronicaBody>
</p:FatturaElettronica>
